snlkuharlocal/src/AccumulationRegisters/ОстаткиДоступныхКМ/ОстаткиДоступныхКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДоступныхКМ</name>
  <resources>
    <name>ЭмитированноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Нанесен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПриемка</name>
    <comment>Для шапок ОКС с возвратами</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_БезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Прочее</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ИспользованиеДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Конфискация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоГосударственномуКонтракту</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоОбразцам</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_РозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Уничтожение</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утилизация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утрата</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ДистанционнаяПродажа</name>
    <comment>Возврат при дистанционном способе продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей</name>
    <comment>Возврат товара, выведенного изоборота  для  производственных целей</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд</name>
    <comment>Возврат товара, выведенного из оборота для собственных нужд</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи</name>
    <comment>Возврат в оборот возврат приобретение не для перепродажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПродажаЧерезВендинг</name>
    <comment>Возврат товара, выведенного из оборота для продажи  через  вендинговый аппарат</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_РозничнаяРеализация</name>
    <comment>Возврат при розничной реализации</comment>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
    <comment>Отгрузка в ЕАЭС</comment>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Испорчен</name>
    <comment>Списание не нанесееных КМ. Испорчен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Уничтожен</name>
    <comment>Списание не нанесееных КМ. Уничтожен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Утерян</name>
    <comment>Списание не нанесееных КМ. Утерян.</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ</name>
    <comment>RETAIL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ_ДистПродажи</name>
    <comment>REMOTE_SALE_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратОтКонечногоПокупателя</name>
    <comment>LEGAL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС</name>
    <comment>EEC_EXPORT_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ИспорченоЛибоУтеряно</name>
    <comment>KM_SPOILED</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/AccumulationRegisters/ОстаткиДоступныхКМ/ManagerModule.bsl
Функция ЗаписатьПриходРасходКМ(Регистратор) Экспорт
	Если ЗначениеЗаполнено(Регистратор) И Метаданные.РегистрыНакопления.ОстаткиДоступныхКМ.СтандартныеРеквизиты.Регистратор.Тип.СодержитТип(ТипЗнч(Регистратор)) Тогда
		Попытка
			СформироватьДвиженияПоРегистратору(Регистратор);
		Исключение
		КонецПопытки;		
	КонецЕсли;	
КонецФункции //ЗаписатьПриходРасходКМ(Регистратор)

Функция СформироватьДвиженияПоРегистратору(Регистратор)
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(Период)						КАК Период,
	|	Регистратор							КАК Регистратор,
	|	ВЫБОР 
	|		КОГДА ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука) ТОГДА Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) 
	|	КОНЕЦ 								КАК Номенклатура,	
	|	ШтрихКодУпаковки.ТипКода 			КАК ТипКода,
	|	ШтрихКодУпаковки.СпособВводаВОборот КАК СпособВводаВОборот,
	|	Статус,
	|	Местонахождение,
	|	ВПути,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихКодУпаковки) КАК Количество	
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ
	|	Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Регистратор,	                    
	|	ВЫБОР 
	|		КОГДА ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука) ТОГДА Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) 
	|	КОНЕЦ,
	|	ШтрихКодУпаковки.ТипКода,
	|	ШтрихКодУпаковки.СпособВводаВОборот,	
	|	Статус,
	|	Местонахождение,
	|	ВПути
	|";		
		
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	НЗ = РегистрыНакопления.ОстаткиДоступныхКМ.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор, Истина);
	
	тНанесеннных = Неопределено;
	
	МестоположениеПоХКМ = ОпределитьМестонахождениеПоХКМ(Регистратор);	
	ПодразделениеОдн	= Справочники.Подразделения.НайтиПоКоду("SSP-0211");
	
	ЭтоВозврат 			= Ложь;
	ЭтоПриход			= Ложь;
	ЭтоИмпорт			= Ложь;
	ЭтоПеремещение  	= Ложь;
	ЭтоКомплектация  	= Ложь;
	ЭтоКомиссияНаБТК 	= Ложь;
	
	ВидОперацииИСМП 	= Неопределено;
	
	Операция		= Неопределено;
	ПропуститьДокумент = Ложь;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
		рШапки		 = ПолучитьРеквизитыШапки(Регистратор, "Операция,ДокОснование");
		
		Операция	 = рШапки.Операция;
		ДокОснование = рШапки.ДокОснование;
		ТипОснования = ТипЗнч(ДокОснование);
		
		Местонахождение = МестоположениеПоХКМ.Отправитель;
		
		Если ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Местонахождение = МестоположениеПоХКМ.Получатель;
			
			рШапки		= ПолучитьРеквизитыШапки(ДокОснование, "ДокОснование,КодОперации");
			КодОперации = рШапки.КодОперации;			
			Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя
				ИЛИ КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		
				ЭтоВозврат = Истина;
			Иначе
				ЭтоПриход = Истина;
				
				Если ЗначениеЗаполнено(рШапки.ДокОснование) И ТипЗнч(рШапки.ДокОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					ЭтоИмпорт = Истина;									
				КонецЕсли; 
			КонецЕсли;			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
			ЭтоПеремещение = Истина;		
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКассовойСмены") Тогда
			ЭтоВозврат = Истина;			
			
			МестоположениеПоХКМ.Получатель = МестоположениеПоХКМ.Отправитель;
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			Если ПолучитьРеквизитШапки(ДокОснование, "Контрагент.Код") = "SST-0235" Тогда
				ЭтоКомиссияНаБТК = Истина;			
			КонецЕсли; 
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
			ПропуститьДокумент = Истина;
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
			ПропуститьДокумент = Истина;			
		КонецЕсли;		
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
		рШапки = ПолучитьРеквизитыШапки(Регистратор, "ВидОперацииИСМП,ДокументОснование,ПодразделениеНанесения");				
		
		Местонахождение = ОпределитьМестонахождениеПоОперМаркировки(Регистратор);
		ВидОперацииИСМП	= рШапки.ВидОперацииИСМП;
		
		Если ТипЗнч(рШапки.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда			
			КодОперации = ПолучитьРеквизитШапки(рШапки.ДокументОснование, "КодОперации");
			Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя
				ИЛИ КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
				ЭтоВозврат = Истина;
			КонецЕсли;
		КонецЕсли; 
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
		ЭтоКомплектация	= Истина;
	КонецЕсли;
	
	Если ЭтоКомиссияНаБТК Тогда
		НЗ.Записать();
		Возврат Неопределено;		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Если НЕ ЗначениеЗаполнено(Запись.Местонахождение) Тогда
			Запись.Местонахождение = ПодразделениеОдн;			
		КонецЕсли; 
		
		Если Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Эмитирован Тогда
			Запись.ЭмитированноКМ = Выборка.Количество;
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати Тогда
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЛистМаркировкиОстатков") Тогда //Это долбаные возвраты недособраных коробок				
				НЗ.Удалить(Запись);			
				Запись = Неопределено;
			Иначе
				Запись.ВидДвижения		= ВидДвиженияНакопления.Расход;
				Запись.ЭмитированноКМ 	= Выборка.Количество;			
				
				Запись = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.ДоступноКМ		= Выборка.Количество;
				
				Если НЕ ЗначениеЗаполнено(Запись.Местонахождение) Тогда
					Запись.Местонахождение = ПодразделениеОдн;			
				КонецЕсли;
			КонецЕсли;			
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Распечатан Тогда
			Если ЭтоКомплектация Тогда
				Запись.ВидДвижения		= ВидДвиженияНакопления.Расход;
				Если Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда
					Запись.ЭмитированноКМ 	= Выборка.Количество;
				Иначе				
					Запись.ДоступноКМ	= Выборка.Количество;
				КонецЕсли;
				
				Запись = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.ДоступноКМ		= Выборка.Количество;
				
				Если НЕ ЗначениеЗаполнено(Запись.Местонахождение) Тогда
					Запись.Местонахождение = ПодразделениеОдн;			
				КонецЕсли;
			КонецЕсли;			
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Нанесен Тогда			
			Запись.ВидДвижения	= ВидДвиженияНакопления.Расход;
			Если Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда
				Запись.ЭмитированноКМ = Выборка.Количество;
			Иначе				
				Запись.ДоступноКМ	= Выборка.Количество;
			КонецЕсли;
			
			Запись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.ДоступноКМ	= Выборка.Количество;
			Запись.Нанесен		= Истина;
			
			Если ЗначениеЗаполнено(МестоположениеПоХКМ.Получатель) Тогда
				Запись.Местонахождение = МестоположениеПоХКМ.Получатель;			
			КонецЕсли; 
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте Тогда
			Если ЭтоПеремещение Тогда
				Запись.ВидДвижения		= ВидДвиженияНакопления.Расход;
				Запись.ДоступноКМ		= Выборка.Количество;
				Запись.Нанесен			= Истина;
				
				Запись.Местонахождение  = МестоположениеПоХКМ.Отправитель;
				
				Запись = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.ДоступноКМ		= Выборка.Количество;
				Запись.Нанесен			= Истина;
				Запись.Местонахождение  = МестоположениеПоХКМ.Получатель;								
			Иначе
				Если Операция = Перечисления.СкладскиеОперации.Отгрузка Тогда
					Запись.ВидДвижения		= ВидДвиженияНакопления.Расход;
					Запись.ДоступноКМ	 	= Выборка.Количество;
					Запись.Местонахождение 	= МестоположениеПоХКМ.Отправитель;				
				Иначе
					Если ЭтоВозврат Тогда				
						Запись.ДоступноКМ		= Выборка.Количество;
						Запись.Нанесен			= Истина;
						
						Запись.Местонахождение	= Местонахождение;
					Иначе
						Если ЭтоПриход Тогда 
							Если Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда //По импорту отрабатывает при нанесении
							Иначе								
								Если 
									Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка								
									ИЛИ Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство Тогда
									
									Запись.ВидДвижения		= ВидДвиженияНакопления.Расход;
									Запись.ЭмитированноКМ 	= Выборка.Количество;
									Запись.Местонахождение 	= ПодразделениеОдн;							
								Иначе
									НЗ.Удалить(Запись);						
								КонецЕсли;
								
								Запись = НЗ.Добавить();
								ЗаполнитьЗначенияСвойств(Запись, Выборка);
								Запись.ДоступноКМ		= Выборка.Количество;
								Запись.Нанесен			= Истина;				
								
								Если ЗначениеЗаполнено(МестоположениеПоХКМ.Получатель) Тогда
									Запись.Местонахождение = МестоположениеПоХКМ.Получатель;
								КонецЕсли;
							КонецЕсли;
						Иначе //По маркировке остатков - срабатывает при "Готов к печати"
							НЗ.Удалить(Запись);				
							Запись = Неопределено;
						КонецЕсли;			
					КонецЕсли;			
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли 
			Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Вложен
			ИЛИ Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю 
			ИЛИ Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Списан Тогда			
			
			Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа
				ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС Тогда
				//Списывается когда - ОтгруженПокупателю
			Иначе
				Если тНанесеннных = Неопределено Тогда
					тНанесеннных = ПолучитьКоличестваНанесенных(Регистратор);			
				КонецЕсли;
			
				НЗ.Удалить(Запись);
				Запись = Неопределено;			
				
				СписатьКМ(НЗ, Выборка, тНанесеннных, Местонахождение);		
			КонецЕсли;			
		КонецЕсли; 
		
		Если Запись<>Неопределено И Запись.ДоступноКМ = 0 И Запись.ЭмитированноКМ  = 0 Тогда
			НЗ.Удалить(Запись);			
		КонецЕсли; 
	КонецЦикла; 
		
	НЗ.Записать();	
КонецФункции //СформироватьДвиженияПоРегистратору(Регистратор)

Функция ОпределитьМестонахождениеПоОперМаркировки(ОперСсылка)
	Результат = Неопределено;
	Если ЗначениеЗаполнено(ОперСсылка) И ТипЗнч(ОперСсылка) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
		рШапки = ПолучитьРеквизитыШапки(ОперСсылка, "ПодразделениеНанесения,КодУзлаСоздания,ДокументОснование");					
		Если ЗначениеЗаполнено(рШапки.ПодразделениеНанесения) Тогда
			Результат = рШапки.ПодразделениеНанесения;
		Иначе
			ДокОснование = рШапки.ДокументОснование;
			Если ЗначениеЗаполнено(ДокОснование) Тогда
				МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(ДокОснование));
				Если МетаОбъект<>Неопределено Тогда
					Если МетаОбъект.Реквизиты.Найти("Склад") <> Неопределено Тогда
						Результат = Маркировка_ПИ.ФизическоеПодразделениеСклада(ПолучитьРеквизитШапки(ДокОснование, "Склад"));
					ИначеЕсли МетаОбъект.Реквизиты.Найти("СкладПолучатель") <> Неопределено Тогда
						Результат = Маркировка_ПИ.ФизическоеПодразделениеСклада(ПолучитьРеквизитШапки(ДокОснование, "СкладПолучатель"));						
					ИначеЕсли МетаОбъект.Реквизиты.Найти("Подразделение") <> Неопределено Тогда
						Результат = ПолучитьРеквизитШапки(ДокОснование, "Подразделение");
					КонецЕсли;				
				КонецЕсли; 							
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Результат) Тогда
				Узел = Маркировка_ПИ.УзелПоКоду(рШапки.КодУзлаСоздания, "Основной");
				Если ЗначениеЗаполнено(Узел) Тогда
					Результат = ПолучитьРеквизитШапки(Узел, "Подразделение");
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ОпределитьМестонахождениеПоОперМаркировки(ОперСсылка)

Функция ОпределитьМестонахождениеПоХКМ(ДокСсылка)
	Результат = Новый Структура("Отправитель,Получатель");
	
	Если ЗначениеЗаполнено(ДокСсылка) И ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
		Результат = ПолучитьРеквизитыШапки(ДокСсылка, "Отправитель,Получатель");	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()

Функция ПолучитьКоличестваНанесенных(Регистратор)
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|		ШтрихКодУпаковки.Владелец 			КАК Номенклатура,
	|		ШтрихКодУпаковки.ТипКода			КАК ТипКода, 
	|		ШтрихКодУпаковки.СпособВводаВОборот	КАК СпособВводаВОборот,
	|		СУММА(КолНанесенных) 				КАК КолНанесенных
	|	ИЗ
	|	(
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|			ШтрихКоды.ШтрихКодУпаковки КАК ШтрихКодУпаковки,
	|			ВЫБОР 
	|				КОГДА ШтрихКоды.ШтрихКодУпаковки.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт) ТОГДА 1
	|				КОГДА Статусы.ШтрихКодУпаковки ЕСТЬ NULL ТОГДА 0 
	|				ИНАЧЕ 1 
	|			КОНЕЦ КАК КолНанесенных
	|		ИЗ
	|			РегистрСведений.СтатусыКМ_Факт КАК ШтрихКоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СтатусыКМ_Факт КАК Статусы			
	|		ПО
	|			Статусы.ШтрихКодУпаковки = ШтрихКоды.ШтрихКодУпаковки
	|			И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Нанесен)
	|			И ШтрихКоды.ШтрихКодУпаковки.СпособВводаВОборот<>ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт)
	|			И Статусы.Период <= ШтрихКоды.Период 
	|		ГДЕ
	|			ШтрихКоды.Регистратор = &Регистратор
	|	) КАК Данные
	|	СГРУППИРОВАТЬ ПО
	|		ШтрихКодУпаковки.Владелец,
	|		ШтрихКодУпаковки.ТипКода, 
	|		ШтрихКодУпаковки.СпособВводаВОборот	
	|";	
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);	
	
	ТД = Запрос.Выполнить().Выгрузить();
	
	ТД.Индексы.Добавить("Номенклатура");
	
	Возврат ТД;
КонецФункции //ПолучитьКоличестваНанесенных(Регистратор)

Функция СписатьКМ(НЗ, Выборка, тНанесенных, Местонахождение = Неопределено)
	сПоиска = Новый Структура("Номенклатура,ТипКода,СпособВводаВОборот");
	ЗаполнитьЗначенияСвойств(сПоиска, Выборка);
	
	КолВсего 		= Выборка.Количество;
	
	КолНеНанесенных	= КолВсего;	
	КолНанесенных   = 0;	
	
	СтрокиНанесенных = тНанесенных.НайтиСтроки(сПоиска);
	Если СтрокиНанесенных.Количество() > 0 Тогда
		КолНанесенных 	= Макс(0, Мин(КолВсего, СтрокиНанесенных[0].КолНанесенных));			
		КолНеНанесенных = КолНеНанесенных - КолНанесенных;
	КонецЕсли;
	
	Если КолНанесенных > 0 Тогда
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Запись.ДоступноКМ	= КолНанесенных;
		Запись.Нанесен		= Истина;
		
		Если ЗначениеЗаполнено(Местонахождение) Тогда
			Запись.Местонахождение = Местонахождение;		
		КонецЕсли; 
	КонецЕсли;
	
	Если КолНеНанесенных > 0 Тогда
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Запись.ДоступноКМ	= КолНеНанесенных;
		Запись.Нанесен		= Ложь;			
		
		Если ЗначениеЗаполнено(Местонахождение) Тогда
			Запись.Местонахождение = Местонахождение;		
		КонецЕсли;
	КонецЕсли;	

КонецФункции //СписатьКМ(НЗ, Выборка, тНанесенных, Местонахождение = Неопределено)

Функция ОчиститьДвижения(ДокСсылка) Экспорт
	НЗ = РегистрыНакопления.ОстаткиДоступныхКМ.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокСсылка, Истина);
	
	Если ЗначениеЗаполнено(НЗ.Отбор.Регистратор.Значение) Тогда
		НЗ.Записать();			
	КонецЕсли;
КонецФункции //ОчиститьДвижения(ДокСсылка) Экспорт
